<template>
    <section id="announcement" class="my-5">
		<div class="container">
			<div class="row">
				<div class="col-md-12">
					<div class="title">
						<h2>ВСЕМ ВСЕМ ВСЕМ!!!</h2>
						<img class="announcement__logo" src="/images/layouts/announcement/announcement.png" alt="">
					</div>
				</div>

				<div class="col-12">
					<p>
						СШ “Славянская” продолжает набор учащихся в 5-12 классы на 2023-2024 учебный год.
					</p>

					<p>
						Целью нашей школы является формирование интеллектуально и физически развитой, социально компетентной и творческой личности. У нас сложился на редкость гармоничный союз учителей, учеников и родителей, для которых "Славянская"-это образ жизни!
					</p>

					<p>
						Если Вы желаете, чтобы к Вашему ребёнку был индивидуальный подход,обращайтесь к нам! Если Вы мечтаете, чтобы Ваш ребёнок стал яркой личностью, обращайтесь к нам! Если Вы хотите, чтобы спустя годы Ваши дети с теплотой и благодарностью вспоминали школу, обращайтесь к нам!
					</p>
					<p>(010) 55 94 04, &nbsp;
						(095) 03 21 91</p>
					<br>

					<h3><strong>ВНИМАНИЕ!!! действует гибкая система скидок оплаты за обучение</strong></h3>
				</div>
			</div>
		</div>
	</section>
</template>

<script>
    export default {

    }
</script>

<style scoped>

</style>
