<template>
	<div>
		<!-- Page breadcrumb -->
		<section id="mu-page-breadcrumb">
			<div class="container">
				<div class="row">
					<div class="col-md-12">
						<div class="mu-page-breadcrumb-area">
							<h2 style="color: white">О школе</h2>

							<ol class="breadcrumb" >
								<li class="breadcrumb-item"><nuxt-link to="/">Главная</nuxt-link></li>
								<li class="breadcrumb-item active">О школе</li>
							</ol>
						</div>
					</div>
				</div>
			</div>
		</section>
		<!-- End breadcrumb -->

		<!-- Start contact  -->
		<section id="mu-contact">
			<div class="container">
				<div class="row">
					<div class="col-md-12">
						<div class="mu-contact-area">
							<!-- start title -->
							<div class="mu-title">
								<h2>О школе</h2>
								<p>Средняя школа «Славянская» – единственное в Республике Армения негосударственное
									общеобразовательное учреждение с русским языком обучения. Учредитель школы –
									Общественная организация «Россия» Республики Армения (решение Координационного
									Совета от 16.07.1997 г.).
									Учебные занятия начались 4 февраля 1998 года.
									Средняя школа «Славянская» занесена в Реестр зарубежных российских школ.</p>
							</div>
							<!-- end title -->

							<!-- start contact content -->
							<br><br><br>
							<div class="mu-contact-content">
								<div class="row">
									<div class="col-md-10 col-md-offset-1">
										<strong>Миссия школы</strong>
										<p>Миссия средней школы «Славянская» заключается в осуществлении долгосрочного партнёрства с учащимися, их родителями, социальными институтами с целью формирования нравственно - деятельностной личности ученика как субъекта образовательного процесса и мирового сообщества. Работа школы направлена на то, чтобы учащиеся смогли стать полноправными членами различных социальных общностей благодаря квалифицированной и высоко - профессиональной деятельности сотрудников.</p>
									</div>
								</div>
							</div>

							<br><br><br><br><br><br>
							<div class="mu-contact-content">
								<div class="row">
									<div class="col-md-10 col-md-offset-1">
										<strong>Цель школы</strong>
										<p>Стратегическая цель школы - воспитание социально компетентной и творческой личности, интеллектуально и физически развитой, с достаточным уровнем самосознания и ответственности перед обществом, приближение к идеалу гуманистического образования, обеспечение возможности интеграции саморегулирующейся, саморазвивающейся, самосовершенствующейся личности в системе мировой и национальных (армянской и русской) культур с использованием различных путей и условий, в том числе и посредством гуманитарной составляющей образовательного процесса.</p>
										<p>Существенную роль в становлении образовательного пространства играет интеграция основного и дополнительного образования, урочной и воспитательной работы, ученического самоуправления и различных школьных сообществ.</p>
									</div>
								</div>
							</div>

							<br><br><br><br><br><br>
							<div class="mu-contact-content">
								<div class="row">
									<div class="col-md-10 col-md-offset-1">
										<strong>Основные педагогические идеи воспитания</strong>
										<ul style="list-style-type: disc">
											<li>становление Человека культуры, свободной, гуманной, духовной, творческой, конкурентноспособной Личности;</li>
											<li>совместное сотрудничество учеников, учителей в решении общих задач, обеспечивающих жизнедеятельность взрослых и детей;</li>
											<li>воспитание существенных личностных качеств: патриотизма, самосознания и гражданственности, ответственности, культуры общения, толерантности, духовной самоотдачи, милосердия</li>
											<li>ориентирование на вечные абсолютные ценности – Жизнь, Отечество, Семья, Человек, Знание, Труд, Культура, Мир, Земля, Добро, Истина, Красота, Любовь, Справедливость, Забота, Вера;</li>
											<li>сочетание инновационности и стабильности (традиционности) методов воспитания.</li>
										</ul>
									</div>
								</div>
							</div>

							<br><br><br><br><br><br>
							<div class="mu-contact-content">
								<div class="row">
									<div class="col-md-10 col-md-offset-1">
										<strong>Учебные планы и программы</strong>
										<p>Учебные планы и программы СШ «Славянская» созданы на основе базисных учебных планов и программ, утверждённых Министерством образования и науки РА и Министерством науки и образования РФ. В их основе – идея всеобщей гуманитаризации всего учебно-воспитательного процесса, последовательного использования интегративного подхода и интерактивных методов обучения с широким применением современных образовательных технологий.</p>
										<p>Большое внимание в учебной деятельности уделяется проблемному обучению, индивидуальному подходу к личности учащегося, использованию ТСО, средств наглядности и дидактики, мультимедийных средств обучения.</p>
										<p>Углубленное изучение русского языка и литературы, иностранных языков сочетается с глубоким постижением основ армянского языка , армянской литературы, истории, географии Армении, истории Армянской Церкви. Работа по предметам учебного цикла основывается на двух основных направлениях: «Познаём Россию» и «Знакомимся с Арменией».</p>
										<p>В школе действуют мультимедийный Ресурс-Центр, Лаборатория по подготовке в ВУЗы, Лаборатория интенсивного обучения армянскому языку, Коррекционная Служба.</p>
										<p>Постоянно проводятся предметные недели, языковые дни и месячники, познавательные утренники и вечера. Большое внимание уделяется развитию творчества учителя и развитию исследовательских навыков старшеклассников.</p>
										<p>Ученики школы неоднократно становились победителями и призёрами предметных олимпиад различного уровня (Ереван, Москва, Санкт-Петербург).</p>
									</div>
								</div>
							</div>
							<!-- end contact content -->
						</div>
					</div>
				</div>

				<hr class="w-100">

				<div class="row align-items-center mb-5">
					<div class="col-lg-8 order-2 order-lg-1 text-center">
						<p class="font-italic my-4">
							Директор школы со дня основания до марта 2020 года - Яковенко Юрий Иванович, председатель ОО «Россия» РА, член Всемирного Координационного Совета российских соотечественников, член Координационного Совета национальных меньшинств при аппарате Президента РА, член редакционного Совета газеты «Друзья России», член Попечительского Совета по присуждению стипендий Мэра Москвы. Ранее был членом Совета соотечественников при Государственной Думе ФС РФ, а также членом Правления Международного Совета российских соотечественников. Лауреат Международной Пушкинской премии.
						</p>
					</div>

					<div class="col-lg-3 offset-lg-1 order-1 order-lg-2">
						<img src="/images/layouts/founders/director-yakovenko.jpg" class="img-fluid mb-4 mb-lg-0" alt="">
					</div>
				</div>

<!--				<hr class="w-100">-->

				<div class="row align-items-center mb-5">
					<div class="col-lg-3 offset-lg-1 order-1 order-lg-1 text-center">
						<img src="/images/layouts/founders/director-vengrzhanovich.png" class="img-fluid mb-4 mb-lg-0" alt="">
					</div>

					<div class="col-lg-8 order-2 order-lg-2">
						<p class="font-italic my-4">
							Мери Робертовна Венгржанович. Директор школы с 01.04.2020. Занимала должность педагога-организатора СШ "Славянская" с 2009 по 2015 гг. Лауреат Международной Пушкинской премии.
						</p>
					</div>
				</div>
			</div>
		</section>
		<!-- End contact  -->
	</div>
</template>

<script>
    export default {
        name: "about",

		head() {
        	return {
        		title: 'О школе'
			}
		},
    }
</script>

<style scoped>

</style>
